Repository: mozilla-l10n/mt-training-data
Catalog: ug/ug_pontoon.tmx
Source language: en_us
Languages: ug

source: I'm okay with you handling this info as you explain in Mozilla's <privacyLink>Privacy Policy</privacyLink>
ug: مىنىڭ بۇ ئۇچۇرلارنىڭ Mozilla نىڭ <privacyLink> شەخسىيەت تۈزۈمى</privacyLink> دە چۈشەندۈرۈلگەن بويىچە بىر تەرەپ قىلىنىشىغا باشقا پىكىرىم يوق

source: Include appropriate citation
ug: مۇۋاپىق نەقىلى بار

source: Includes email, username & demographic info, available right away
ug: ئېلخەت، ئىشلەتكۈچى ئىسمى ۋە نوپۇس ئۇچۇرىنى ئۆز ئىچىگە ئالىدۇ

source: Includes mp3s and related sentences, may take some time to prepare
ug: Mp3 ۋە مۇناسىۋەتلىك جۈملىلەرنى ئۆز ئىچىگە ئالىدۇ، تەييارلاشقا بىر ئاز ۋاقىت كېتىشى مۇمكىن

source: Indonesian
ug: ھىندونېزىيەچە

source: Information about the language
ug: تىل ھەققىدىكى ئۇچۇرلار

source: In Progress
ug: ئىلگىرىلەش

source: Interested in learning more and contributing to the project?
ug: بۇ تۈرگە تۆھپە قوشۇش توغرىسىدا تېخىمۇ كۆپ مەزمۇنغا قىزىقامسىز؟

source: Interface language:
ug: ئارايۈز تىلى:

source: Interlingua
ug: ئارىلىق تىل

source: Interlingue
ug: ئىنتىرلىڭچە

source: [interrupted by background noise]
ug: [ئارقىدىكى شاۋقۇن ئۈزۈۋەتتى]

source: Intersex
ug: جىنس ئۆزگەرتكەن

source: Invalid file
ug: ئىناۋەتسىز ھۆججەت

source: Irish
ug: ئىرېلاندىيەچە

source: IsiNdebele (North)
ug: شىمالىي ندېبېلېچە

source: IsiNdebele (South)
ug: جەنۇبىي ندېبېلېچە

source: <isoCodeLink>ISO Codes</isoCodeLink> if known
ug: <isoCodeLink> ISO كودى </isoCodeLink> ئەگەر بىلسىڭىز

source: Is the clip valid?
ug: بۇ ئاۋاز ئىناۋەتلىكمۇ؟

source: Italian
ug: ئىتاليانچە

source: It contains words or phrases that are hard to read or pronounce.
ug: ئۇنىڭدا ئوقۇش ياكى تەلەپپۇز قىلىش تەس بولغان سۆز ياكى ئىبارىلەر بار.

source: It costs almost a million dollars a year to host the datasets and improve the platform for the 100+ language communities who rely on what we do?
ug: ساندان توپلىمىنىڭ مۇلازىمېتىرى ۋە قىلغان ئىشىمىزغا تايىنىدىغان 100+ تىل جامائىتى ئىشلىتىۋاتقان سۇپىنى ياخشىلاشقا يىلىغا بىر مىليون دوللار ئەتراپىدا پۇل كېتىدۇ؟

source: It costs almost a million dollars a year to host the datasets and improve the platform for the 100+ language communities who rely on what we do. <strong>If you value open, inclusive data - donate today!</strong>
ug: قىلىۋاتقان ئىشىمىزغا تايىنىدىغان 100+ تىل جامائىتىنىڭ سۇپىسىنى ياخشىلاش ۋە سانلىق مەلۇمات توپلىمىنى ئاسراشقا يىلىغا بىر مىليون دوللار ئەتراپىدا چىقىم كېتىدۇ. <strong>ئەگەر ئوچۇق، سىغدۇرۇشچان سانلىق مەلۇماتنى قەدىرلىسىڭىز، بۈگۈن ئىئانە قىلىڭ!</strong>

source: It costs a lot of money to continually host and release the datasets, improve the platform and run <africaMradiLink>community programmes</africaMradiLink>.
ug: سانلىق مەلۇمات توپلىمىنى ئۈزلۈكسىز ئاسراش ۋە تارقىتىش، سۇپىنى ياخشىلاش ۋە <africaMradiLink>جامائەت پىروگراممىسى</africaMradiLink>نى ئىجرا قىلىشقا نۇرغۇن پۇل كېتىدۇ.

source: It is very important that all text sentences are <publicDomain>public domain</publicDomain> (cc0) as the Common Voice dataset is released under a cc0 license. Only ever upload a sentence if you are sure, and always include the relevant citation.
ug: Common Voice ساندان توپلىمى cc0 ئىجازەتنامىسىدە تارقىتىلغانلىقى ئۈچۈن، بارلىق تېكىست جۈملىلىرىنىڭ <publicDomain> ئاممىۋى دائىرە </publicDomain> ( cc0 ) ئىجازىتىدە بولۇشى تولىمۇ مۇھىم. ئەگەر جەزملەشتۈرسىڭىز ئاندىن جۈملە يۈكلەڭ، ھەمدە ھەمىشە مۇناسىۋەتلىك نەقىل مەنبەسىنى ئەسكەرتىڭ.

source: It is written in a language different than what I’m reviewing.
ug: ئۇ مەن تەكشۈرۈۋاتقانغا ئوخشىمايدىغان تىلدا يېزىلغان.

source: It is written in a language different than what I’m speaking.
ug: مەن سۆزلەيدىغان تىلغا ئوخشىمايدىغان تىلدا يېزىلىپتۇ.

source: It’s important to include citations so we can check that sentences are in the public domain and no copyright restriction apply.
ug: نەقىل كەلتۈرۈشنى ئۆز ئىچىگە ئېلىش تولىمۇ مۇھىم، شۇڭا بىز جۈملىلەرنىڭ ئاممىۋى ساھەدە ئىكەنلىكىنى، نەشر ھوقۇقى چەكلىمىسىنىڭ قوللىنىلمىغانلىقىنى تەكشۈرەلەيمىز.

source: It takes a lot to make Common Voice happen! We don't do it alone. Want to partner with us? We'd love to hear from you.
ug: Common Voice نى ئەمەلگە ئاشۇرۇش ئۈچۈن نۇرغۇن ئىش كېتىدۇ! بىز ئۇنى يالغۇز قىلمايمىز.ھەمكارلاشقۇچىمىز بولۇشنى خالامسىز؟ ئاۋازىڭىزنى ئاڭلاشنى خالايمىز.

source: Izhorian
ug: ئىزورانچە

source: Japanese
ug: ياپونچە

source: Javanese
ug: جاۋانىسچە

source: Join the Common Voice mailing list
ug: Common Voice ئېلخەت تىزىمىغا قوشۇلۇڭ

source: Just Unsure?
ug: ئانچە ئېنىق ئەمەسمۇ؟

source: Kabardian
ug: كاباردەيچە

source: Kabyle
ug: كابىلېچە

source: Kalenjin
ug: كالېنجىن

source: Kannada
ug: كانناداچە

source: Kaqchikel
ug: كاكچىكىلچە

source: Karakalpak
ug: قاراقالپاقچە

source: Kazakh
ug: قازاقچە

source: { $kb }kb max
ug: { $kb }kb ئەڭ چوڭ بولغاندا

source: Keep
ug: ساقلا

source: Keep it up, record again <recordIcon></recordIcon>
ug: داۋاملاشتۇرۇڭ، يەنە ئۈنگە ئېلىڭ <recordIcon></recordIcon>

source: Keep the recordings
ug: ئۈن خاتىرىسىنى ساقلاڭ

source: Keep track of your progress and metrics across multiple languages.
ug: كۆپ خىل تىلدىكى ئىلگىرىلەش ۋە كۆرسەتكۈچلىرىڭىزنى كۆزىڭىزدىن ساقىت قىلماڭ.

source: Keep track of your progress with a profile
ug: تەرجىمىھال قۇرۇش ئارقىلىق ئىلگىرىلىشىڭىزنى ئىز قوغلاپ تۇرۇڭ

source: Keep track of your progress with a profile and help our voice data be more accurate.
ug: تەرجىمىھالىڭىز ئارقىلىق ئىلگىرىلىشىڭىزنى ئىزلاپ، ئاۋاز سانلىق مەلۇماتىمىزنىڭ تېخىمۇ توغرا بولۇشىغا ياردەم قىلىڭ.

source: Kelabit
ug: كېلابىت

source: Kenyah
ug: كېنىيەچە

source: Khmer
ug: كىخمېرچە

source: K'iche'
ug: كېچيۇچە

source: Kichwa
ug: كىچۋاچە

source: Kidaw'ida
ug: كىداۋ ئىدا

source: Kikuyu
ug: كىكۇيۇچە

source: Kinyarwanda
ug: رىۋانداچە

source: Kom
ug: كوم

source: Komi-Zyrian
ug: كومى زىرىيانچە

source: Konkani (Devanagari)
ug: كونكانىچە(Devanagari)

source: Korean
ug: كورېيەچە

source: Kurmanji Kurdish
ug: كۇرمانجى كۇردچە

source: Kyrgyz
ug: قىرغىزچە

source: Language
ug: تىل

source: Language Fundamentals (e.g. Digits, Letters, Money)
ug: تىل ئاساسى (مەسىلەن سان، ھەرپ، پۇل)

source: Language Request
ug: تىل تەلىپى

source: Language request successfully submitted, thank you.
ug: تىل تەلىپى مۇۋەپپەقىيەتلىك يوللاندى ، رەھمەت.

source: Languages
ug: تىللار

source: Languages can have their own validation rules with additional requirements when they localize. If there is no specific validation file for a language, the English rules will show for contributors.
ug: تىللار يەرلىكلەشتۈرۈلگەندە قوشۇمچە تەلەپلەر بىلەن ئۆزىنىڭ دەلىللەش قائىدىسىگە ئىگە بولالايدۇ. ئەگەر بىر تىلنىڭ كونكرېت دەلىللەش ھۆججىتى بولمىسا ، ئىنگلىزچە قائىدىلەر تۆھپىكارلارغا كۆرسىتىلىدۇ.

source: Lao
ug: لائوسچە

source: Large bulk sentence submission
ug: تۈركۈملەپ جۈملە يوللاش

source: Large scale corporates and platform companies
ug: چوڭ تىپتىكى شىركەت ۋە سۇپا شىركەتلىرى

source: Last Updated: { $lastUpdatedTimeStamp }
ug: ئاخىرقى يېڭىلانغان ۋاقتى: { $lastUpdatedTimeStamp }

source: Latgalian
ug: لاتگالىيانچە

source: Latvian
ug: لاتۋىيەچە

source: Launched
ug: ئېلان قىلىندى

source: Laz
ug: لازچە

source: Leaderboard Visibility
ug: شەرەپ تاختىنىڭ كۆرۈنۈشچانلىقى

source: Learn about partnerships with Common Voice
ug: Common Voice بىلەن ھەمكارلىشىش ھەققىدىكى بىلىملەر

source: Learn how to take part
ug: قانداق قاتنىشىشنى ئۆگىنىۋېلىڭ

source: Learn how to transcribe
ug: خەتكە قانداق پۈتۈشنى ئۆگىنىش

source: Learn how to use this page
ug: بۇ بەتنى قانداق ئىشلىتىشنى ئۆگىنىۋېلىڭ

source: Learn More
ug: تەپسىلاتى

source: Leaving now means you’ll lose your changes
ug: ھازىر ئايرىلسىڭىز ئۆزگىرىشلەر يوق بولۇپ كېتىدۇ

source: Leaving now means you'll lose your progress
ug: ھازىر ئايرىلسىڭىز ئىلگىرىلىشىڭىزنى يوقىتىسىز

source: Length
ug: ئۇزۇنلۇقى

source: Let's Get Started
ug: باشلايلى

source: Letters must be valid in the language being spoken. For example, “ж” is a letter in the Russian alphabet but is never used in English and so should never appear in any English source text.
ug: سۆزلىنىۋاتقان تىلدا ھەرپلەر كۈچكە ئىگە بولۇشى كېرەك. مەسىلەن، «ж» رۇس ئېلىپبەسىدىكى ھەرپ، ئەمما ئىنگلىزچىدا ھەرگىز ئىشلىتىلمەيدۇ، شۇڭا ھېچقانداق ئىنگلىزچە تېكىستتە كۆرۈنمەسلىكى كېرەك.

source: LibriSpeech is a corpus of approximately 1000 hours of 16Khz read English speech derived from read audiobooks from the LibriVox project.
ug: LibriSpeech تەخمىنەن 1000 سائەت ئەتراپىدىكى LibriVox تۈرىدىكى ئاۋازلىق كىتابلاردىن تاللانغان 16Khz لىق ئىنگلىزچە ئوقۇشلۇق.

source: License
ug: ئىجازەتنامە

source: License: <licenseLink>CC-0</licenseLink>
ug: ئىجازەتنامە: <licenseLink> CC-0 </licenseLink>

source: License: <licenseLink>{ $license }</licenseLink>
ug: ئىجازەتنامە: <licenseLink>{ $license }</licenseLink>

source: Ligurian
ug: لېگىرىچە

source: Lingala
ug: لىنگالاچە

source: Link Copied
ug: ئۇلانما كۆچۈرۈلدى

source: Links to websites that can help us understand the language
ug: مەزكۇر تىلنى چۈشىنىشىمىزگە ياردەم بېرەلەيدىغان تور بېكەتلەرگە ئۇلىنىش

source: Listen
ug: ئاڭلاي

source: Listening
ug: ئاڭلاش

source: Listen options menu
ug: تاللانما تىزىملىكنى تىڭشايدۇ

source: Listen-Queue
ug: ئاڭلاش-ئۆچرەت

source: Lithuanian
ug: لىتۋاچە

source: Loading…
ug: يۈكلەۋاتىدۇ…

source: Loading sentences…
ug: جۈملىلەرنى يۈكلەۋاتىدۇ…

source: Localized
ug: يەرلىكلەشتۈرۈلگەن

source: Log In
ug: كىرىش

source: Login Identity
ug: كىرىش كىملىكى

source: <loginLink>Login</loginLink> or <loginLink>sign up</loginLink> to add multiple sentences
ug: كۆپ جۈملە قوشۇش ئۈچۈن <loginLink>تىزىمغا كىرىڭ</loginLink> ياكى <loginLink>تىزىملىتىڭ</loginLink>

source: Log in or sign up to get started
ug: باشلاش ئۈچۈن كىرىڭ ياكى تىزىملىتىڭ

source: Log In / Sign Up
ug: كىرىڭ / تىزىملىتىڭ

source: Log In / Sign Up with { $company } email
ug: { $company } نىڭ ئېلخېتى ئارقىلىق كىرىڭ / تىزىملىتىڭ

source: Log Out
ug: تىزىمدىن چىقىش

source: Lojban
ug: لوجبانچە

source: Look for text where the copyright no longer applies - for example most books that were published before 1920
ug: نەشر ھوقۇقى قوغدالمايدىغان تېكىستنى ئىزدەڭ-مەسىلەن، 1920-يىلىدىن ئىلگىرى نەشر قىلىنغان كىتابلار

source: Looks like there aren't any clips to listen to in this language. Help us fill the queue by recording some now.
ug: قارىغاندا بۇ تىلدا ئاڭلايدىغان مەزمۇن يوقتەك تۇرىدۇ. ئاۋازىڭىزنى ئۈنگە ئېلىپ بۇ بوشلۇقنى تولدۇرۇشقا ياردەملىشىڭ.

source: Luganda
ug: گانداچە

source: Luxembourgish
ug: لىيۇكسېمبۇرگچە

source: Macedonian
ug: ماكېدونچە

source: Mada
ug: مادا

source: Maithili
ug: مايتىلىچە

source: Make sure the platform is recording before you start speaking, and that it only stops once you’re finished.
ug: سۆزلەشتىن بۇرۇن سۇپىنىڭ ئۈنگە ئېلىشنى باشلىغانلىقىغا ھەمدە سۆزلەپ توختىغاندا ئۈنگە ئېلىشنى توختىتىشقا كاپالەتلىك قىلىڭ.

source: Make sure the sentence meets the following criteria:
ug: جۈملىنىڭ تۆۋەندىكى ئۆلچەملەرگە ماس كېلىدىغانلىقىنى جەزملەشتۈرۈڭ:

source: Make your submitted data as rich as possible by providing some anonymous demographic data. We de-identify all demographic data before making it public.
ug: يوللىغان سانلىق مەلۇماتلارنى نامسىز ئۇچۇرىڭىز بىلەن تەمىنلەش ئارقىلىق ئىمكانقەدەر مول قىلىڭ. بىز سانلىق مەلۇماتلىرىنى ئاشكارىلاشتىن بۇرۇن بارلىق ئۇچۇرىڭىزنى پەرقلەندۈرگىلى بولمايدىغان قىلىمىز.

source: Malagasy
ug: ماداغاسقارچە

source: Malay
ug: مالايچە

source: Malayalam
ug: مالايامچە

source: Male/Masculine
ug: ئەر

source: Maltese
ug: مالتاچە

source: Manage Email Subscriptions
ug: ئېلخەت مۇشتەرىلىكىنى باشقۇرۇش

source: Manage Subscriptions
ug: مۇشتەرىلىكنى باشقۇرۇش

source: Mapudungun
ug: مەپوچىچە

source: Marathi
ug: ماراتىچە

source: <mark>Check</mark>
ug: <mark>تەكشۈر</mark>

source: <mark>Data</mark>
ug: <mark>سانلىق مەلۇمات</mark>

source: <mark>Transcribe</mark>
ug: <mark>خەت پۈت</mark>

source: <mark>Using CV for</mark><br/><mark>your research?</mark>
ug: <mark>Common Voice نى ئىشلىتىپ</mark><br/><mark>تەتقىقات قىلامسىز؟</mark>

source: <mark>We need</mark><br/><mark>your help!</mark>
ug: <mark>بىز </mark><br/><mark> ياردىمىڭىزگە موھتاج!</mark>

source: Maximum file size: 25 MB
ug: ئەڭ چوڭ ھۆججەت سىغىمى: 25MB

source: Maybe our <homepageLink>homepage</homepageLink> will help? To ask a question, please join the <matrixLink>Matrix community chat</matrixLink>, monitor site issues via <githubLink>GitHub</githubLink> or visit <discourseLink>our Discourse forums</discourseLink>.
ug: بەلكىم بىزنىڭ <homepageLink>تور بېتىمىز</homepageLink> نىڭ ياردىمى بولۇشى مۇمكىن؟ <matrixLink>Matrix</matrixLink> قا كىرىپ سوئال سوراڭ، <githubLink>GitHub</githubLink> دىن تور بەتتىكى مەسىلىلەرنى كۆرۈڭ ياكى <discourseLink>مۇنازىرە مۇنبىرى</discourseLink> نى زىيارەت قىلىڭ.

source: Mbo
ug: مبو

source: Meadow Mari
ug: مىدوۋ مارىچە

source: Media and Entertainment
ug: تاراتقۇ ۋە كۆڭۈل ئېچىش

source: Medumba
ug: مېدۇمباچە

source: Meetei Lon
ug: مانىپۇرىچە

source: Message
ug: ئۇچۇر

source: Michoacán Mazahua
ug: مىچوكان مازاخو

source: Minimum sentences in file: 1000
ug: ھۆججەتتىكى ئەڭ ئاز جۈملە: 1000

source: [Mismatched content]
ug: [ماس كەلمىگەن مەزمۇن]

source: Misreadings
ug: خاتا ئوقۇلغانلار

source: Missing an 's' at the end of a word.
ug: بىر سۆزنىڭ ئاخىرىدا «s» كەم.

source: Missing an <strong>'s'</strong> at the end of a word.
ug: بىر سۆزنىڭ ئاخىرىدا <strong>«s»</strong> كەم.

source: Missing 'A' or 'The' at the beginning of the recording.
ug: ئۈنگە ئېلىشنىڭ بېشىدىكى «A» ياكى «The» كەم.

source: Missing <strong>'A'</strong> or <strong>'The'</strong> at the beginning of the recording.
ug: ئۈن خاتىرىلەشنىڭ بېشىدا <strong>«A»</strong> ياكى <strong>«The»</strong> كەم.

source: Missing the end of the last word by cutting off the recording too quickly.
ug: ئۈنگە ئېلىش بەك تېز بولۇپ ئەڭ ئاخىرقى سۆز كەم قالغان.

source: Mixed
ug: ئارىلاش

source: Mokpwe
ug: موكپۋې

source: Moksha
ug: موكشاچە

source: Mongolian
ug: موڭغۇلچە

source: More
ug: تېخىمۇ كۆپ

source: [More has been recorded than the required text]
ug: [تەلەپ قىلىنغان تېكىستتىن كۆپ خاتىرىلەندى]

source: More languages coming soon
ug: پات ئارىدا تېخىمۇ كۆپ تىل تارقىتىلىدۇ

source: Mossi
ug: موسسىچە

source: Most of the data used by large companies isn’t available to the majority of people. We think that stifles innovation. So we’ve launched Common Voice, a project to help make voice recognition open and accessible to everyone.
ug: كۆپ ساندىكى كىشىلەر چوڭ شىركەتلەر ئىشلىتىدىغان سانلىق مەلۇماتلارغا ئېرىشەلمەيدۇ. بۇ يېڭىلىق يارىتىشنى بوغۇپ قويىدۇ. شۇڭا بىز Common Voice تۈرىنى ئېلان قىلىپ، ھەرقانداق ئادەمنىڭ ئاۋاز تونۇتۇش تېخنىكىسىغا ئېرىشەلىشى ئۈچۈن ياردەمدە بولماقچى.

source: Most of the data used by large companies isn’t available to the majority of people. We think that stifles innovation. So we’ve launched Project Common Voice, a project to help make voice recognition open to everyone.
ug: كۆپ ساندىكى كىشىلەر چوڭ شىركەتلەر ئىشلىتىدىغان سانلىق مەلۇماتلارغا ئېرىشەلمەيدۇ. بۇ يېڭىلىق يارىتىشنى بوغۇپ قويىدۇ. شۇڭا بىز Common Voice تۈرىنى ئېلان قىلىپ، ھەرقانداق ئادەمنىڭ ئاۋاز تونۇتۇش تېخنىكىسىغا ئېرىشەلىشى ئۈچۈن ياردەمدە بولماقچى.

source: Most recordings are of people talking in their natural voice. You can accept the occasional non-standard recording that is shouted, whispered, or obviously delivered in a ‘dramatic’ voice. Please reject sung recordings and those using a computer-synthesized voice.
ug: كۆپىنچە ئۈن خاتىرىلىرى كىشىلەرنىڭ تەبىئىي ئاۋازىدا پاراڭلىشىۋاتقان ئاۋازىدۇر. سىز ۋارقىراپ-جارقىراپ، پىچىرلانغان ياكى ئېنىقلا «دراماتىك» ئاۋازدا يەتكۈزۈلگەن ئۆلچەملىك بولمىغان خاتىرىلەرنى قوبۇل قىلالايسىز. ناخشا خاتىرىسى ۋە كومپيۇتېردا بىرىكتۈرۈلگەن ئاۋاز ئىشلىتىۋاتقانلارنى رەت قىلىڭ.

source: Mozilla Common Voice is an initiative to help teach machines how real people speak.
ug: Common Voice بولسا Mozilla نىڭ ئادەملەرنىڭ قانداق سۆزلەيدىغانلىقىنى ماشىنىلارغا ئۆگىتىشنى نىشان قىلغان تۈرى.

source: Mozilla Common Voice is made possible by a diverse community of activists, linguists, data scientists, academics and software engineers from all over the world. The project is stewarded by the Mozilla Foundation.
ug: Mozilla Common Voice دۇنيانىڭ ھەر قايسى جايلىرىدىكى پائالىيەتچىلەر، تىلشۇناسلار، سانلىق مەلۇمات تەتقىقاتچىلىرى، ئاكادېمىكلار ۋە يۇمشاق دېتال ئىنژېنېرلىرىدىن تەشكىل تاپقان كۆپ مەنبەلىك جەمئىيەت ئەزالىرىنىڭ تەتقىقات نەتىجىسىنىڭ مەھسۇلى. بۇ تۈرنى Mozilla ۋەخپىسى باشقۇرىدۇ.

source: Mozilla Common Voice is the world’s most diverse crowdsourced open speech dataset - and we’re powered entirely by donations. It costs almost a million dollars a year to host the datasets and improve the platform for the 100+ language communities who rely on what we do. If you value open, inclusive data - <b>donate today!</b>
ug: Mozilla Common Voice دۇنيادىكى ئەڭ كۆپ خىللىققا ئىگە ئوچۇق تىل سانلىق ساندان توپلىمى - بىز پۈتۈنلەي ئىئانىگە تايىنىمىز. ساندان توپلىمىنىڭ مۇلازىمېتىرى ۋە قىلغان ئىشىمىزغا تايىنىدىغان 100+ تىل جامائىتى ئىشلىتىۋاتقان سۇپىنى ياخشىلاشقا يىلىغا بىر مىليون دوللار ئەتراپىدا پۇل كېتىدۇ. ئەگەر ئوچۇق، سىغدۇرۇشچان سانلىق مەلۇماتنى قەدىرلىسىڭىز - <b> بۈگۈن ئىئانە قىلىڭ! </b>

source: Mozilla’s open source voice recognition engine Deep Speech can be used to build speech recognition applications. Read our <githubLink>Github overview</githubLink> or join the <discourseLink>DeepSpeech Discourse</discourseLink> to learn how to get started.
ug: Common Voice سانلىق مەلۇمات ئامبىرى Mozilla نىڭ ئوچۇق مەنبەلىك ئاۋاز پەرقلەندۈرۈش ماتورى Deep Speech نى قوللىنىپ، ئاۋاز پەرقلەندۈرۈش پروگراممىلىرىنى قۇرالايسىز. قەيەردىن باشلاشنى بىلىشتە بىزنىڭ <githubLink>قىسقىچە تونۇشتۇرۇش Github </githubLink> نى ئوقۇڭ ياكى <discourseLink>DeepSpeech مۇنازىرىسىگە</discourseLink> قاتنىشىڭ.

source: Mutual accountability.
ug: ئۆز-ئارا جاۋابكارلىق.

source: Name
ug: ئىسمىڭىز

source: Names of your language
ug: تىلىڭىزنىڭ نامى

source: Native Language
ug: ئانا تىل

source: Nature and Environment
ug: تەبىئەت ۋە مۇھىت

source: Need help with the Sex or Gender changes?
ug: جىنىس ياكى جىنس ئۆزگەرتىشتە ياردەمگە ئېھتىياجلىقمۇ؟

source: Need some help with accent?
ug: تەلەپپۇزدا ئازراق ياردەم كېرەكمۇ؟

source: Need some help with variants?
ug: ۋارىيانتلارغا ئازراق ياردەم كېرەكمۇ؟

source: Need to download your data?
ug: ئۇچۇرلىرىڭىزنى چۈشۈرەمسىز؟

source: Nepali
ug: نېپالچە

source: New Language Launch
ug: يېڭى تىل قوزغىتىلىدۇ

source: News and Current Affairs
ug: خەۋەر ۋە نۆۋەتتىكى ۋەقەلەر

source: Next
ug: كېيىنكى

source: Ngiembon
ug: نگېمبون

source: Nias
ug: نىئاسچە

source: Nigerian Pidgin English
ug: نىگېرىيە پىدگىن ئىنگلىزچە

source: NKo
ug: نكو

source: No
ug: ياق

source: [No ‘a’ in the original text]
ug: [ئەسلى تېكىستتە «بىر» يوق]

source: <noCopyright>No copyright</noCopyright> restrictions (cc-0)
ug: <noCopyright>نەشر ھوقۇقى</noCopyright> چەكلىمىسى يوق ( cc-0 )

source: No foreign letters
ug: چەتئەلچە ھەرپلەر يوق

source: No gravatar found for your email
ug: سىزنىڭ ئېلخىتىڭىز ئۈچۈن gravatar تېپىلمىدى

source: No information
ug: ھېچقانداق ئۇچۇر يوق

source: No information available
ug: ھېچقانداق ئۇچۇر يوق

source: No microphone found.
ug: مىكروفون تېپىلمىدى.

source: Non-binary
ug: ئىككىلىسى ئەمەس

source: No numbers and special characters
ug: سان ۋە ئالاھىدە ھەرپ يوق

source: Northern Sotho
ug: شىمالىي سوتوچە

source: Northwest Gbaya
ug: غەربىي شىمال گبايا

source: Norwegian Bokmål
ug: بوكمالچە

source: Norwegian Nynorsk
ug: يېڭى نورۋېگچە

source: No sentences to review. <addLink>Add more sentences now!</addLink>
ug: تەكشۈرىدىغان ھېچقانداق جۈملە يوق. <addLink>ھازىرلا تېخىمۇ كۆپ جۈملە قوشاي!</addLink>

source: ⓘ Not all sentences and clips have Variant tags yet!
ug: ⓘھەممە جۈملە ۋە ئۈن ئۈزۈندىسىنىڭ شېۋە بەلگىسى بولۇشى ناتايىن!

source: Note: When set to 'Visible', this setting can be changed from the <profileLink>Profile page</profileLink>
ug: ئەسكەرتىش: «كۆرۈنۈشچان» قىلىپ تەڭشەلگەندە، بۇ تەڭشەكنى <profileLink> تەرجىمىھال بېتى </profileLink> دىن ئۆزگەرتكىلى بولىدۇ.

source: Note: You will still need to select between Speak or Listen to change contribution type.
ug: ئەسكەرتىش: سىز يەنىلا «سۆزلەش» ياكى «ئاڭلاش»نى تاللاش ئارقىلىق تۆھپە قوشۇش ئۇسۇلىنى تاللىشىڭىز كېرەك.

source: Not Found
ug: تېپىلمىدى

source: No Thanks
ug: ياق رەھمەت

source: No thanks, continue speaking
ug: رەھمەت، داۋاملىق سۆزلەي

source: No variant selected
ug: ۋارىيانت تاللانمىدى

source: Now that you know a little bit more about Common Voice, why not try it out? Click on the microphone icon to start reading sentences aloud. <br/><br/>If you prefer to review other people's voice contributions, click on the play icon. You’ll help confirm that recordings match the sentences written on screen.
ug: ھازىر سىز Common Voice توغرىسىدا مەلۇم چۈشەنچە ھاسىل قىلدىڭىز، نېمىشقا سىناپ باقمايسىز؟ مىكروفون سىنبەلگىسىنى چېكىپ جۈملىلەرنى ئوقۇشنى باشلاڭ.<br/><br/> ئەگەر سىز باشقىلارنىڭ ئاۋازىنى دەلىللەشكە بەكرەك قىزىقسىڭىز قويۇش سىنبەلگىسىنى بىسىڭ. بۇ ئارقىلىق سىز ئۈن خاتىرىسى بىلەن ئېكراندىكى جۈملىلەرنىڭ ماسلاشقان ياكى ماسلاشمىغانلىقىنى جەزملەشتۈرۈشكە ياردەم قىلالايسىز.

source: Now you can donate your voice to help us build an open-source voice database that anyone can use to make innovative apps for devices and the web. Read a sentence to help machines learn how real people speak. Check the work of other contributors to improve the quality. It’s that simple!
ug: ھازىر ئاۋازىڭىزنى ئىئانە قىلسىڭىز، ئوچۇق كودلۇق ئاۋاز ئامبىرى قۇرۇشقا ياردەم بەرگەن بولىسىز، ھەرقانداق ئادەم ئۇنى ئىشلىتىپ ئۈسكۈنە ۋە توردا يېڭىلىققا تولغان ئەپلەرنى ياساش ئۈچۈن ئىشلىتەلەيدۇ. بىر جۈملە ئوقۇپ ماشىنىلارنىڭ كىشىلەرنىڭ قانداق سۆزلەيدىغانلىقىنى چۈشىنىشىگە ياردەم بېرىڭ. باشقا تۆھپىكارلارنىڭ خىزمىتىنى تەكشۈرۈپ سۈپەتنى ئۆستۈرۈڭ. مۇشۇنداق ئاددىي!

source: Number of Voices
ug: ئاۋاز سانى

source: Numbers
ug: سانلار

source: Occitan
ug: ئاۋكچە

source: Odia
ug: ئورىياچە

source: Off
ug: تاقاق

source: Offensive Content
ug: تېرىكتۈرىدىغان مەزمۇن

source: Offensive language
ug: ھاقارەتلىك سۆز

source: Offensive speech
ug: ھاقارەت تىلى

source: Offline Sources
ug: تورسىز مەنبەلەر

source: On
ug: ئوچۇق

source: On desktop devices you can contribute by downloading…
ug: ئۈستەل يۈزى ئۈسكۈنىلىرىدە چۈشۈرۈش ئارقىلىق تۆھپە قوشالايسىز…

source: On his head he wore a beret.
ug: ئۇ باشىغا فىرانسىيە بېرېت شىلەپىسى كىيگەن ئىدى.

source: On iOS please continue with Safari to enable recording…
ug: iOS دا safari ئارقىلىق ئۈنگە ئېلىشنى قوزغىتىپ داۋاملاشتۇرۇڭ…

source: Only show me sentences and clips from my variant
ug: شېۋەمدىكى جۈملە ۋە ئۈن ئۈزۈندىلىرىنىلا كۆرسەت

source: On the other hand, if you think that the reader has never come across the word before, and is making an incorrect guess at the pronunciation, please reject. If you are unsure, use the skip button.
ug: يەنە بىر جەھەتتىن، ئەگەر سىز ئوقۇرمەننى بەلكىم بۇ سۆزنى ئۇچرىتىپ باقمىغان، تەلەپپۇزدا خاتا پەرەز قىلىۋاتىدۇ دەپ ئويلىغان بولسىڭىز رەت قىلىڭ. ئەگەر جەزملىيەلمىسىڭىز، ئاتلا توپچىسىنى چېكىڭ.

source: On the other hand, if you think that the reader has probably never come across the word before, and is simply making an incorrect guess at the pronunciation, please reject. If you are unsure, use the skip button.
ug: يەنە بىر جەھەتتىن، ئەگەر سىز ئوقۇرمەننى ئەزەلدىن بۇ سۆزنى ئۇچرىتىپ باقمىغان، تەلەپپۇزدا خاتا پەرەز قىلىۋاتىدۇ دەپ ئويلىغان بولسىڭىز رەت قىلىڭ. ئەگەر جەزملىيەلمىسىڭىز، ئاتلا توپچىسىنى چېكىڭ.

source: Open innovation is at the heart of what we do. For research collaborations, data collection or interviews, <emailFragment>reach out.</emailFragment>
ug: ئوچۇق يېڭىلىق يارىتىش ئىشىمىزنىڭ يادروسى. تەتقىقات ھەمكارلىقى، سانلىق مەلۇمات توپلاش ياكى زىيارەت قىلىش ئۈچۈن، <emailFragment>بىز بىلەن ئالاقىلىشىڭ. </emailFragment>

source: Optionally join on our email list for updates and new information about the project.
ug: تۈر توغرىسىدىكى يېڭىلانمىلار ۋە يېڭى ئۇچۇرلار ئۈچۈن ئېلخەت تىزىملىكىمىزگە خالىسانە قوشۇلۇڭ.
